<?php
$questionnire = [
    [
        'title'=>'База данных Sakila',
        'db' => 'sakila',
        'questions' => [
            ['Получить список актёров', 1],
            ['Найти актеров по имени', 11],
            ['Найти повторяющиеся имена актёров', 12],
            ['Найти самую популярную среди актеров фамилию', 13],
            ['Получить список языков', 2],
            ['Получить упорядоченный список языков', 3],
            ['Получить отсортированный список фильмов с лимитом', 4],
            ['Найти сотрудников по условию', 5],
            ['Получить отсортированный список фильмов с условием', 6],
            ['Найти названия фильмов по описанию', 7],
            ['Найти полные имена активных клиентов', 8],
            ['Найти адреса с помощью подзапроса', 9],
            ['Найти адреса с помощью JOIN', 10],
            ['Найти всех актёров по фильму', 14],
            ['Найти все фильмы актёра', 15],
            ['Найти количество фильмов в которых актёр принимал участие', 19],
            ['Найти актёров популярней чем HENRY BERRY', 20],
            ['Найти распределение фильмов по категориям', 16],
            ['Найти среднюю продолжительность фильма', 17],
            ['Найти среднюю продолжительность фильма по категории', 18]
        ]
    ]
];