            <div class="question-title">Помогите сделать SQLtest.online еще лучше!</div>
            <div style="font-size:small; padding: 0.5em;">
                <p>Приветствую вас, любители SQL!</p>

                <p>Я пишу вам сегодня, потому что мне нужна ваша помощь.</p>

                SQLtest.online – это бесплатная платформа, созданная для того, чтобы помочь людям всех уровней освоить SQL.<br>
                Мы предлагаем широкий спектр интерактивных тестов, задач и обучающих материалов, которые помогут вам улучшить свои навыки SQL.<br>
                Платформа уже помогла множеству людей, но мы хотим сделать ее еще лучше. И именно здесь вы можете нам помочь!

                <p>Как вы можете помочь:
                    <ul>
                    <li>Пригласите своих друзей и коллег присоединиться к SQLtest.online!</li>
                    <li>Расскажите о SQLtest.online своим друзьям и коллегам. Поделитесь ссылкой на наш сайт в социальных сетях, по электронной почте или лично.</li>
                    <li>Напишите статью или пост в блоге о SQLtest.online. Поделитесь своим опытом работы с платформой.</li>
                    <li>Вместе мы можем сделать SQLtest.online лучшим ресурсом для изучения SQL!</li>
                    </ul>
                </p>
                <p>
                Чем больше людей будет пользоваться платформой, тем лучше она станет. Мы сможем добавить больше контента, улучшить функции и создать лучшее сообщество для любителей SQL.
                </p>
                <p>
                Спасибо за вашу помощь!<br>
                Команда <a href='https://sqltest.online/ru'>SQLtest.online</a>
                </p>
            </div>