        <style>
            .menu-ad .question-wrapper a:link, a:visited {
                color: var(--menu-link-color);
            }
            .menu-ad .question-wrapper a:hover, a:active {
                color: var(--menu-link-color);
            }
        </style>
        <div class="menu-ad">
            <div id="yandex_rtb_R-A-4716552-2">
                <div class="question-wrapper">
                    <div class="question-title">🎉 Друзья! Рады представить вам наш новый образовательный проект – открытый онлайн-учебник по SQL!</div>
                    <div style="font-size:small; padding: 0.5em;">
                        <p>
                            📚 За основу мы взяли проект Querynomicon, который планируем не только перевести, но и адаптировать под потребности русскоязычной аудитории. В перспективе мы хотим развить его до полноценного интерактивного учебника.
                        </p>
                        <p> 🤝 И здесь нам нужна ваша помощь! Проект размещен в открытом <a href="https://github.com/vndv/querynomicon">Git-репозитории</a>, что позволяет каждому внести свой вклад в его развитие:
                            <ul>
                                <li>Сделайте форк проекта</li>
                                <li>Внесите свои изменения или дополнения</li>
                                <li>Отправьте pull request</li>
                            </ul>
                        </p>
                        <p>
                            ✅ Все предложения будут внимательно рассмотрены и после модерации добавлены в основной репозиторий.
                        </p>
                        <p>
                            💡 Давайте вместе создадим качественный ресурс для изучения SQL!
                        </p>
                        <p>
                            Текущая доступна по ссылке: <a styel="color: var(--menu-link-color);"href="https://querynomic.one/">Querynomic.One</a>
                        </p>
                    </div>
                </div>
            </div>
        </div>