<link rel="stylesheet" type="text/css" href="/about.css?{$VERSION}" media="all">
<div class="about">
    <div class="section top colored">
        <div>
            <h2>Политика конфиденциальности SQLtest</h2>
        </div>
    </div>
    <div class="section not-colored" style="height: 100%;">
        <div style="display: block;">

            <p>Настоящая Политика конфиденциальности описывает, как SQLtest («мы», «нас» или «наш») собирает, использует и передает личную информацию.
            когда вы используете нашу службу SQLtest.</p>
        
            <h3>1. Информация, которую мы собираем:</h3>
            
            <ol>
                <li>Когда вы используете SQLTest, мы можем запросить доступ к информации вашей учетной записи у различных провайдеров OAuth2, включая Google, Яндекс, LinkedIn, GitHub и VK. Этот доступ может включать, но не ограничивается, вашим адресом электронной почты и деталями профиля, указанными в процессе авторизации.</li>
            </ol>
            
            <h3>2. Как мы используем информацию:</h3>
            
            <ol>
                <li><strong>Аутентификация.</strong> Мы используем информацию, полученную через OAuth2, для аутентификации вашей
                    личности и предоставления вам доступа к нашим услугам.</li>
                <li><strong>Управление учетной записью.</strong> Данные вашей учетной записи используются для управления вашей учетной записью в
                    SQLtest.</li>
                <li><strong>Коммуникация.</strong> Мы можем использовать ваш адрес электронной почты, чтобы сообщать вам о важных
                    обновлениях, уведомления или вопросов, связанных с поддержкой.</li>
            </ol>
            
            <h3>3. Обмен информацией:</h3>
            
            <ol>
                <li><strong>Сторонние услуги.</strong> Мы не продаем и не передаем вашу личную информацию третьим лицам.</li>
                <li><strong>Юридические требования.</strong> Мы можем раскрыть вашу информацию, если этого требует закон или
                    ответ на обоснованные запросы органов государственной власти.</li>
            </ol>
            
            <h3>4. Видимость достижений:</h3>
            <ol>
                <li><strong>По умолчанию — публично:</strong> По умолчанию ваши достижения являются публичными. Вы можете изменить это в <a href="/ru/user/profile">настройках профиля</a>.</li>
            </ol>
            
            <h3>5. Безопасность:</h3>
            
            <ol>
                <li><strong>Безопасность данных.</strong> Мы принимаем разумные меры предосторожности для защиты вашей информации. 
                    Однако поскольку нет абсолютно безопасных методов хранения и передачи данных через Интернет, и мы не можем гарантировать вам абсолютная безопасность.</li>
            </ol>
            
            <h3>6. Обновления настоящей Политики конфиденциальности:</h3>
            
            <ol>
                <li><strong>Изменения.</strong> Мы можем время от времени обновлять нашу Политику конфиденциальности. Любые изменения вступят в силу
                    сразу после публикации обновленной Политики конфиденциальности на сайте <a href ="https://sqltest.online">SQLtest</a>.</li>
            </ol>
            
            <h3>7. Свяжитесь с нами:</h3>
            
            <ol>
                <li><strong>Вопросы</strong>. Если у вас есть какие-либо вопросы или сомнения относительно нашей Политики конфиденциальности, свяжитесь с нами.
                    нас в <a href="https://t.me/sqlize"> нашем чате Telegram</a>.</li>
            </ol>
    
        </div>
    </div>
    <div class="section bottom colored">
        <div>
            <h4>Настоящая Политика конфиденциальности последний раз обновлялась 28 декабря 2025 г.</h4>
        </div>
    </div>
</div>