<?php
$translations = [
    'About' => 'О проекте',
    'Ask in our chat!' => 'Обращайтесь в наш чат!',
    'Ask in our telegram chat!' => 'Обращайтесь в наш телеграм чат!',
    'Books' => 'Книги',
    'Donate' => 'Donate',
    'Logout' => 'Выход',
    'Have a questions?' => 'Есть вопросы?',
    'Like the site? Share it!' => 'Понравился сайт? Поделитесь!',
    'Privacy policy' => 'Политика конфиденциальности',
    'Questions?' => 'Вопросы?',
    'SQLtest' => 'SQLtest',
    'site-description' => 'Прокачайте свои навыки SQL с помощью нашего интерактивного тренажера! Решайте разнообразные вопросы по SQL, от базовых до продвинутых. Подготовьтесь к собеседованиям и научитесь составлять эффективные SQL-запросы для решения реальных задач. Наши задания подойдут как новичкам, так и опытным специалистам.',
    'site-promo' => 'задачи по SQL'
];